# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "schniz/tap"

# packages
brew "ack"
brew "ansible"
brew "terraform"
brew "ranger"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose"
brew "exa"
brew "entr" #Event Notify Test Runner
brew "fd"
brew "fzf"
brew "fdupes"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "noti"
brew "pwgen"
brew "procs"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "vim"
brew "wdiff"
brew "wget"
brew "yarn"
brew "zsh"
brew "fzf"

# Launguage
brew "go"
brew "rust"
brew "python"
brew "php"
brew "node"
brew "composer"
brew "mysql"
brew "n"

# brew "pygobject3"
# brew "gtk+3"

# Applications
cask "docker" #gui
cask "hyper"
cask "imageoptim"
cask "visual-studio-code"
cask "google-chrome"
cask "keepassxc"
cask "scroll-reverser"
cask "spectacle"
cask "alfred"
cask "cheatsheet"
cask "libreoffice"
cask "slack"
cask "postman"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
